--[[
	游戏定义
]] local _M = {}
_M.KIND_ID = 1002
_M.GAME_PLAYER = 1
_M.GAME_NAME = "连环夺宝"
_M.GS_LHDB_FREE = GameDefine.GAME_STATUS_FREE -- 空闲状态
_M.GS_LHDB_BET = GameDefine.GAME_STATUS_PLAY -- 下注状态

_M.MAX_BET_LINES = 5 -- 最大下注的注数
_M.RES_PATH = "game/lhdb/res/"

_M.MAX_SPEED = 4

_M.GEM_WIDE = 6
_M.GEM_HIGH = 49

_M.Gems = {
    DRILL_GEM = 0, -- 宝石类型:钻头

    BAI_YU = 1, -- 宝石类型:白玉
    BI_YU = 2, -- 宝石类型:碧玉
    MO_YU = 3, -- 宝石类型:墨玉
    MA_NAO = 4, -- 宝石类型:玛瑙
    HU_PO = 5, -- 宝石类型:琥珀

    ZU_MU_LV = 6, -- 宝石类型:祖母绿
    MAO_YAN_SHI = 7, -- 宝石类型:猫眼石
    ZI_SHUI_JING = 8, -- 宝石类型:紫水晶
    FEI_CUI = 9, -- 宝石类型:翡翠
    ZHEN_ZHU = 10, -- 宝石类型:珍珠

    HONG_BAO_SHI = 11, -- 宝石类型:红宝石
    LV_BAO_SHI = 12, -- 宝石类型:绿宝石
    HUANG_BAO_SHI = 13, -- 宝石类型:黄宝石
    LAN_BAO_SHI = 14, -- 宝石类型:蓝宝石
    ZUAN_SHI = 15, -- 宝石类型:钻石

    FAKE_GEM = -1 -- 宝石类型:宝石下沉时用来填充顶部空格的[假的]宝石类型
}

_M.GemRate = {
    [_M.Gems.BAI_YU] = {
        [4] = 0.2,
        [5] = 0.4,
        [6] = 0.5,
        [7] = 0.8,
        [8] = 1,
        [9] = 2,
        [10] = 3,
        [11] = 5,
        [12] = 10,
        [13] = 20,
        [14] = 40
    },
    [_M.Gems.BI_YU] = {
        [4] = 0.4,
        [5] = 0.5,
        [6] = 1,
        [7] = 2,
        [8] = 3,
        [9] = 5,
        [10] = 10,
        [11] = 25,
        [12] = 50,
        [13] = 75,
        [14] = 80
    },
    [_M.Gems.MO_YU] = {
        [4] = 0.5,
        [5] = 1,
        [6] = 2,
        [7] = 4,
        [8] = 8,
        [9] = 16,
        [10] = 50,
        [11] = 100,
        [12] = 200,
        [13] = 500,
        [14] = 600
    },
    [_M.Gems.MA_NAO] = {
        [4] = 1,
        [5] = 3,
        [6] = 5,
        [7] = 6,
        [8] = 10,
        [9] = 75,
        [10] = 100,
        [11] = 1000,
        [12] = 2000,
        [13] = 5000,
        [14] = 6000
    },
    [_M.Gems.HU_PO] = {
        [4] = 2,
        [5] = 5,
        [6] = 10,
        [7] = 50,
        [8] = 100,
        [9] = 200,
        [10] = 500,
        [11] = 2000,
        [12] = 5000,
        [13] = 6000,
        [14] = 8000
    },

    [_M.Gems.ZU_MU_LV] = {
        [5] = 0.2,
        [6] = 0.4,
        [7] = 0.5,
        [8] = 0.8,
        [9] = 1,
        [10] = 2,
        [11] = 3,
        [12] = 5,
        [13] = 10,
        [14] = 20,
        [15] = 45
    },
    [_M.Gems.MAO_YAN_SHI] = {
        [5] = 0.4,
        [6] = 0.5,
        [7] = 1,
        [8] = 2,
        [9] = 3,
        [10] = 5,
        [11] = 10,
        [12] = 25,
        [13] = 50,
        [14] = 75,
        [15] = 100
    },
    [_M.Gems.ZI_SHUI_JING] = {
        [5] = 0.5,
        [6] = 1,
        [7] = 2,
        [8] = 4,
        [9] = 8,
        [10] = 16,
        [11] = 50,
        [12] = 100,
        [13] = 200,
        [14] = 500,
        [15] = 700
    },
    [_M.Gems.FEI_CUI] = {
        [5] = 1,
        [6] = 3,
        [7] = 5,
        [8] = 6,
        [9] = 10,
        [10] = 75,
        [11] = 100,
        [12] = 1000,
        [13] = 2000,
        [14] = 5000,
        [15] = 7000
    },
    [_M.Gems.ZHEN_ZHU] = {
        [5] = 2,
        [6] = 5,
        [7] = 10,
        [8] = 50,
        [9] = 100,
        [10] = 200,
        [11] = 500,
        [12] = 2000,
        [13] = 5000,
        [14] = 6000,
        [15] = 10000
    },

    [_M.Gems.HONG_BAO_SHI] = {
        [6] = 0.2,
        [7] = 0.4,
        [8] = 0.5,
        [9] = 0.8,
        [10] = 1,
        [11] = 2,
        [12] = 3,
        [13] = 5,
        [14] = 10,
        [15] = 20,
        [16] = 50
    },
    [_M.Gems.LV_BAO_SHI] = {
        [6] = 0.4,
        [7] = 0.5,
        [8] = 1,
        [9] = 2,
        [10] = 3,
        [11] = 5,
        [12] = 10,
        [13] = 25,
        [14] = 50,
        [15] = 75,
        [16] = 120
    },
    [_M.Gems.HUANG_BAO_SHI] = {
        [6] = 0.5,
        [7] = 1,
        [8] = 2,
        [9] = 4,
        [10] = 8,
        [11] = 16,
        [12] = 50,
        [13] = 100,
        [14] = 200,
        [15] = 500,
        [16] = 800
    },
    [_M.Gems.LAN_BAO_SHI] = {
        [6] = 1,
        [7] = 3,
        [8] = 5,
        [9] = 6,
        [10] = 10,
        [11] = 75,
        [12] = 100,
        [13] = 1000,
        [14] = 2000,
        [15] = 5000,
        [16] = 8000
    },
    [_M.Gems.ZUAN_SHI] = {
        [6] = 2,
        [7] = 5,
        [8] = 10,
        [9] = 50,
        [10] = 100,
        [11] = 200,
        [12] = 500,
        [13] = 2000,
        [14] = 5000,
        [15] = 10000,
        [16] = 10000
    }
}

-- 服务器命令结构
_M.SUB_S_GAME_START = 701 -- 游戏开始,初始化界面信息
_M.SUB_S_NEXT_GAME = 702 -- 发送宝石布局
_M.SUB_S_GAME_END = 703 -- 游戏结束,写分
_M.SUB_S_CLOSE_GAME = 704 -- 游戏结束,写分
_M.SUB_S_SCENE = 705 -- 断线重连
_M.SUB_S_MESSAGE_INFO = 102 -- 中奖消息
_M.SUB_S_UPDATEGOLDPOOL = 107 -- 更新彩金池

_M.SUB_C_BET = 801 -- 下注
_M.SUB_C_EXIT = 802 -- 退出
_M.SUB_C_NEW = 803 -- 新一局(龙珠探宝结束后选择继续)
_M.SUB_C_BONUS_REPORT = 809 -- 客户端报告自己得到了多少奖金,服务端判断这个报告值是否在自己允许的范围内,是则合法,予以承认,否则按得奖0处理

return _M

